{ "schedule": {
    "version": "0",
    "conference": {
      "title": "MRMCD2013",
      "start": "2013-09-06",
      "end": "2013-09-08",
      "days": "3",
      "timeslot_duration": "00:10",
      "days": [
          {
            "index": "0",
            "date": "2013-09-06",
            "rooms": {
              "Gate 104": [
                  {
                    "id": "5167",
                    "start": "17:53",
                    "duration": "00:30",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-06_17:53_-_mrmcd2013_takeoff_-_unicorn_-_5167",
                    "title": "MRMCD2013: Takeoff",
                    "subtitle": "We wish you a pleasent journey",
                    "track": "Luftfahrt",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "1343",  "full_public_name": "Unicorn"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5189",
                    "start": "18:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-06_18:23_-_don_t_remove_your_ethics_before_flight_-_fukami_-_5189",
                    "title": "Don&#x27;t remove your ethics before flight",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "Nicht erst der Überwachungsskandal rund um PRISM und Tempora zeigt, dass es mehr als genug Techniker zu geben scheint, die bereit sind, am Aufbau dieser Strukturen mitzuwirken - teilweise aus finanziellen Gründen, teilweise weil sie nicht überblicken, wozu ihre Arbeit benutzt wird (z.B. weil sie sich mit nur mit Teilaspekten beschäftigen). Die Keynote beleuchtet wenig akademisch die ganz konkreten Fragen, die sich daraus ergeben. ",
                    "persons": [
                        {"id": "1588",  "full_public_name": "fukami"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5208",
                    "start": "19:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-06_19:23_-_slide_to_unlock_--_or_provide_your_facebook_pictures_-_bluec0re_-_schalla_-_5208",
                    "title": "Slide To Unlock -- or Provide Your Facebook Pictures?",
                    "subtitle": "A Critical Analysis of Biometric Authentication Mechanisms",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "In this talk we present a critical analysis of the four most appropriate candidates of biometric authentication mechanisms on mobile devices: fingerprint, face, voice and iris recognition. The results of our analysis show that there is still no compromise between usability and safety, because especially on mobile devices the unlock mechanism has to be quick and easy and this fact affects the overall security of the authentication mechanism. Using precise cameras and good microphones in mobile devices it is possible to use biometric authentication mechanisms like face, iris or voice recognition, but these methods are still in an immature phase and they suffer from different vulnerabilities which will be described in our presentation. The main reason of this problem is the lack of liveness detection which is crucial for all biometric authentication methods. We show that pictures retrieved from social media are enough to bypass the current biometric recognition mechanisms, even the approaches including built-in liveness detection on android phones.",
                    "description": "Outline
----------
Introduction (5&#x27;)
Basics of Biometric Authentication (10&#x27;)
Mobile Authentication Approaches (10&#x27;)
Description of discovered/intrinsic Weaknesses (10&#x27;)
Introduction of an Evaluation Library (10&#x27;)
Q&amp;A (5&#x27;)

What will attendees gain from the presentation?
---------------------------------------------------------------------
* Thorough understanding of biometric authentication mechanisms
* Connected pitfalls and intrinsic vulnerabilities
* Introduction to tools to properly assess biometric authentication mechanisms on mobile devices

",
                    "persons": [
                        {"id": "4007",  "full_public_name": "bluec0re"},
                        {"id": "3943",  "full_public_name": "schalla"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5196",
                    "start": "20:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-06_20:23_-_too-smart-tvs_-_erik_tews_-_5196",
                    "title": "Too-Smart-TVs",
                    "subtitle": "Wie intelligente Fernseher zum Zuschauertracking missbraucht werden.",
                    "track": "Anonymität im Real Life und außerhalb des Internets",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "1631",  "full_public_name": "erik.tews"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5199",
                    "start": "21:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-06_21:23_-_torservers_net_-_mo_-_5199",
                    "title": "Torservers.net",
                    "subtitle": "Geschichten über den Betrieb von Tor Exit Relays",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Torservers.net startete 2010, und ist inzwischen das größte Netzwerk an Organisationen, die Tor Exit Relays betreiben.",
                    "description": "",
                    "persons": [
                        {"id": "2633",  "full_public_name": "mo"}
                    ],
                    "links": [
                        {"url": "https://www.torservers.net/", "title": "Torservers.net"},
                        {"url": "https://maps.google.com/maps?q=http://www.torservers.net/misc/tormap/tormap.20130906.1MB.kml", "title": "Google Maps: Tor Exits &gt;1MB/s"},
                        {"url": "https://maps.google.com/maps?q=http://www.torservers.net/misc/tormap/tormap.20130906.10MB.kml", "title": "Google Maps: Tor Exits &gt;10MB/s"},
                        {"url": "https://compass.torproject.org/", "title": "Tor Relay Compass"},
                        {"url": "https://metrics.torproject.org/", "title": "Tor Metrics"}
                    ]
                  }
              ],
              "Gate 111": [
                  {
                    "id": "5181",
                    "start": "19:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-06_19:23_-_ipsec_how_to_use_vpn_with_enterprise_hardware_-_progamler_-_5181",
                    "title": "IPSEC How to use VPN with Enterprise Hardware",
                    "subtitle": "",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "In dem Vortrag werden Grundlagen von IPSEC erklaert",
                    "description": "Geschichte

    Standards
        rfc2401 Security Architecture for the Internet Protocol (November 1998)
        rfc2402 IP Authentication Header (November 1998)
        rfc2403 The Use of HMAC-MD5-96 within ESP and AH (November 1998 )
        rfc2405 The Use of HMAC-SHA-1-96 within ESP and AH (November 1998 )
        rfc2406 IP Encapsulating Security Payload (ESP) (November 1998 )
        rfc2408 Internet Security Association and Key Management Protocol (ISAKMP) (November 1998 )
        rfc2409 The Internet Key Exchange (IKE) (November 1998 )
        rfc2412 The OAKLEY Key Determination Protocol (November 1998 )
    Funktionen
        Encryption of user data for privacy.
        Authentication of the integrity of a message to ensure that it is not changed en route.
        Protection against certain types of security attacks, such as replay attacks.
        The ability for devices to negotiate the security algorithms and keys required to meet their security needs.
        Two security modes, tunnel and transport, to meet different network needs.

Übliche Umsetzung

    Site-to-Site
        192.168.1.0/24 &lt;-&gt; 172.16.0.0/16
        192.168.1.0/24 &lt;-&gt; 0.0.0.0/0
        192.168.1.0/24 &lt;-&gt; 31.172.42.0/24
    Site-to-Client
        0.0.0.0/0 &lt;-&gt; 192.168.1.23/32
        172.16.0.0/12 &lt;-&gt; 192.168.1.42/32
        31.172.42.0/24 &lt;-&gt; 192.168.1.42/32
    Server-to-Client
        172.16.23.42/32 &lt;-&gt; 192.168.1.54/32
        31.172.42.85/32 &lt;-&gt; 192.168.1.54/32
    Server-to-Server
        172.16.23.42/32 &lt;-&gt; 10.42.23.54/32
        31.172.42.85/32 &lt;-&gt; 195.160.168.28/32

Modes

    Tunnel

        Im Tunnelmodus wird das ursprüngliche Paket gekapselt und die Sicherheitsdienste von IPsec auf das gesamte Paket angewandt. Der neue (äußere) IP-Header dient dazu, die Tunnelenden (also die kryptografischen Endpunkte) zu adressieren, während die Adressen der eigentlichen Kommunikationsendpunkte im inneren IP-Header stehen. Der ursprüngliche (innere) IP-Header stellt für Router usw. auf dem Weg zwischen den Tunnelenden nur Nutzlast (Payload) dar und wird erst wieder verwendet, wenn das empfangende Security-Gateway (das Tunnelende auf der Empfangsseite) die IP-Kapselung entfernt hat und das Paket dem eigentlichen Empfänger zustellt.

        Im Tunnelmodus sind Gateway-zu-Gateway- oder auch Peer-zu-Gateway-Verbindungen möglich. Da an jeweils einer Seite Tunnelende und Kommunikationsendpunkt auf demselben Rechner zusammenfallen können, sind auch im Tunnelmodus Peer-zu-Peer-Verbindungen möglich. Ein Vorteil des Tunnelmodus ist, dass bei der Gateway-zu-Gateway-Verbindung nur in die Gateways (Tunnelenden) IPsec implementiert und konfiguriert werden muss. Angreifer können dadurch nur die Tunnelendpunkte des IPsec-Tunnels feststellen, nicht aber den gesamten Weg der Verbindung.
        Gliffy 
    Transport
        Im Transportmodus wird der IPsec-Header zwischen dem IP-Header und den Nutzdaten eingefügt. Der IP-Header bleibt unverändert und dient weiterhin zum Routing des Pakets vom Sender zum Empfänger. Der Transportmodus wird verwendet, wenn die „kryptographischen Endpunkte“ auch die „Kommunikations-Endpunkte“ sind. Nach dem Empfang des IPsec-Paketes werden die ursprünglichen Nutzdaten (TCP/UDP-Pakete) ausgepackt und an die höherliegende Schicht weitergegeben. Der Transportmodus wird vor allem für Host-zu-Host- oder Host-zu-Router-Verbindungen verwendet, z.B. für die Netzwerkverwaltung.
    ESP
        Encapsulating Security Payload (ESP) stellt Mechanismen zur Sicherstellung der Authentizität, Integrität und Vertraulichkeit der übertragenen IP-Pakete bereit. Im Unterschied zum AH wird der Kopf des IP-Paketes vom ICV (Integrity check value) nicht berücksichtigt, jedoch werden die Nutzdaten verschlüsselt übertragen. ESP basiert direkt auf IP und verwendet die IP-Protokoll Nummer 50.
    AH
        Der Authentication Header (AH) soll die Authentizität und Integrität der übertragenen Pakete sicherstellen und den Sender authentisieren. Weiterhin schützt er gegen Replay-Angriffe. AH schützt die invarianten Teile eines IP-Datagramms; IP-Header-Felder, die auf dem Weg durch ein IP-Netz von Routern verändert werden können (z. B. TTL), werden nicht berücksichtigt. Werden auf dem Weg durch das Netz Router mit aktivierter Network Address Translation (NAT) passiert, so ändern diese die eigentlich invarianten Teile eines IP-Datagramms ab, folglich ist eine Authentisierung nicht mehr möglich - NAT und AH sind folglich designbedingt inkompatibel - lediglich eine Kombination von NAT und ESP (siehe RFC 3948 – UDP Encapsulation of IPsec ESP Packets) ist möglich. Die Nutzdaten werden bei AH nicht verschlüsselt und sind damit für jeden lesbar. AH basiert direkt auf IP und verwendet die IP-Protokoll Nummer 51.

Umsetzung

    Policy-Based
        Kompatibel zu fast allen Geräten, genaue Beschreibung wer mit wem reden darf
        Src-IP,Dst-IP,Dst-Port
        192.168.1.25, 172.16.25.42, 3306
    Route-based
        Es gibt ein interface auf das geroutet wird, erlaubt ist alles im Tunnnel und kann durch uebliche Instrumente wie Firewalls/Access-Listen eingeschraenkt werden
        0.0.0.0/0, 0.0.0.0/0, Any

Crypto

    des
    3des
    aes128
    aes256

Config exampels
IPSEC (linux, juniper, netgear, fritzbox)
IPSEC+GRE",
                    "persons": [
                        {"id": "3964",  "full_public_name": "proGamler"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5152",
                    "start": "20:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-06_20:23_-_content_security_policy_-_ein_weiterer_vergeblicher_versuch_cross-site_scripting_zu_bandigen_-_sbieber_-_kathrin_schaberle_-_5152",
                    "title": " Content Security Policy - Ein weiterer (vergeblicher) Versuch Cross-Site Scripting zu bändigen?",
                    "subtitle": "",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Cross-Site Scripting (XSS) Schwachstellen sind in der OWASP TOP 10 der Jahre 2010 und 2013 auf Platz 2 bzw. 3. Die Behebung solcher Schwachstellen ist bis heute trotz Hilfsmitteln noch sehr unzuverlässig. Content Security Policy (=CSP) ist eine im Browser implementierte Schutzfunktion, um die Gefahr XSS auf Seiten der Clients einzudämmen. Mithilfe der CSP ist es möglich, dem Browser erlaubte Quellen für eingebundene Skript- oder Medien-Inhalte (z. B. &lt;scrip&gt;, &lt;img&gt;, &lt;object&gt;) zu definieren. In diesem Vortrag wird die Entstehung, sowie der technische Hintergrund der CSP erklärt. Dabei werden die wichtigsten Restriktionsparameter für eine Live-Demonstration herausgepickt und erläutert. Es wird ein Lösungsansatz aufgezeigt, wie man CSP in die eigene Webapplikation integrieren kann und dabei Probleme des CSP-Designs erläutert. ",
                    "description": "",
                    "persons": [
                        {"id": "3923",  "full_public_name": "sbieber"},
                        {"id": "3997",  "full_public_name": "Kathrin Schäberle"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5157",
                    "start": "21:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-06_21:23_-_bausatze_in_hackerspaces_-_muzy_-_5157",
                    "title": "Bausätze in Hackerspaces",
                    "subtitle": "Von der Idee zur Einnahmequelle",
                    "track": "Open Source Entwicklung",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "An langen Abenden in Hackerspaces bilden sich viele Projektideen. Einige werden sofort wieder verworfen, andere wiederum werden sofort realisiert. Mit viel Motivation entsteht aus einer Idee ein fertiges Produkt. Doch wie kann man damit seinen Hackerspace unterstützen? 
",
                    "description": "Wie wärs mit einem Bausatz? Wie man Bausätze erstellt, was man beachten sollte und welche Probleme sich in den Weg stellen können sind Inhalt des Vortrags. Hintergrundinformationen zu bereits abgeschlossenen Bausatzprojekten wie das Hacklace sind im ebenso im Fokus wie allgemeine Tipps und Tricks zu einem tollen Bausatz.

Einen kleinen Ausblick auf die Inhalte gibt es bereits im RaumZeitLabor Blog (siehe verlinkte Website). 
",
                    "persons": [
                        {"id": "3878",  "full_public_name": "muzy"}
                    ],
                    "links": [
                        {"url": "http://hacklace.org", "title": "Hacklace Website"},
                        {"url": "https://raumzeitlabor.de/blog/wie-man-einen-bausatz-bastelt/", "title": "Wie man einen Bausatz bastelt"}
                    ]
                  }
              ],
              "Gate 105 (Workshop Airlines)": [
                  {
                    "id": "5216",
                    "start": "19:23",
                    "duration": "01:30",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-06_19:23_-_nahmaschine_einfuhrung_-_jiska_-_5216",
                    "title": "Nähmaschine (Einführung)",
                    "subtitle": "Workshopreihe für Nährdinen und Nährds",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "Technische Hintergründe, Kissen nähen",
                    "description": "In diesem Workshop lernt ihr, wie eine Nähmaschine funktioniert. Dieser Teil ist auch für die weniger Nähbegeisterten interessant ;)

Danach habt ihr die Möglichkeit, einen Kissenbezug zu nähen. Ideal wäre es also, wenn ihr wisst, wie groß eure Kissen zu Hause so sind oder sogar ein Kissen mitbringt. Standardmaße sind 40x40cm und 80x80cm.

Das Kissen könnt ihr im Rahmen der nachfolgenden Workshops noch besticken oder mit flauschiger Flockfolie bedrucken.

Materialen in diesem Workshop werden gegen einen kleinen Unkostenbeitrag (ca. 2€) gestellt! Ihr müsst also nichts mitbringen und könnt spontan mitmachen ;)",
                    "persons": [
                        {"id": "3921",  "full_public_name": "jiska"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5218",
                    "start": "21:03",
                    "duration": "00:40",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-06_21:03_-_nahmaschine_bikini_-_jiska_-_5218",
                    "title": "Nähmaschine (Bikini)",
                    "subtitle": "Workshopreihe für Nährdinen und Nährds",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "Bikinis, von klein bis groß",
                    "description": "In diesem Workshop bekommt ihr erklärt, wie man Bikinis in allen Größen selber nähen kann. Manche der Techniken könnt ihr auch verwenden, um existierende Bikinis zu verbessern.

Für kleine Größen bekommt ihr gezeigt, wie man daraus optisch mehr machen kann. Für große Größen bekommt ihr gezeigt, wie man ein Ergebnis bekommt, das etwas hält.

Da das Nähen sehr individuell ist und das Ausmessen und Anpassen  zeitaufwendig sind, handelt es sich nur um einen Vortrag, was alles möglich ist, sowie ein paar Ergebnisse zum Anfassen. Wenn ihr viel Zeit und etwas Badelycra mitbringt, besteht die Möglichkeit, später am Abend außerhalb des Workshops noch was eigenes zu nähen.

Mehr Infos &lt;a href=&quot;http://nerdine.org/zenphoto/Tetriskleid/Bikini/&quot;&gt;hier&lt;/a&gt;.",
                    "persons": [
                        {"id": "3921",  "full_public_name": "jiska"}
                    ],
                    "links": [
                    ]
                  }
              ]
            }
          },
          {
            "index": "1",
            "date": "2013-09-07",
            "rooms": {
              "Gate 104": [
                  {
                    "id": "5221",
                    "start": "11:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_11:23_-_kurzstreckenfluge_lightning_talks_-_5221",
                    "title": "Kurzstreckenflüge (Lightning Talks)",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lightning_talk",
                    "language": "de",
                    "abstract": "“In the future, everyone will be world-famous for 15 minutes.” (nach Andy Warhol)",
                    "description": "Du hast ein cooles Projekt, dass du der Welt vorstellen willst? Hier hast du die Chance es in 10 Minuten zu zeigen.

Trag dich im Wiki ein, wenn du auch was zu sagen hast:
http://mrmcd.net/wiki/kurzstreckenfluege_a.k.a_lightning_talks",
                    "persons": [
                    ],
                    "links": [
                        {"url": "http://mrmcd.net/wiki/kurzstreckenfluege_a.k.a_lightning_talks", "title": "Wikiseite zur Anmeldung"}
                    ]
                  },
                  {
                    "id": "5267",
                    "start": "12:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_12:23_-_gamejams_-_xandy_-_5267",
                    "title": "Gamejams",
                    "subtitle": "In 48 Stunden zum fertigen Spiel",
                    "track": "",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "
3 Mal im Jahr entwickeln Programmierer weltweit in nur 48 Stunden über 2000 Spiele zu einem vorgegebenen Thema. Wieso sollte man bei so einem Event mitmachen und wie schafft man es in der kurzen Zeit ein gutes Spiel zu entwickeln? ",
                    "description": "",
                    "persons": [
                        {"id": "4049",  "full_public_name": "xAndy"}
                    ],
                    "links": [
                        {"url": "http://www.ludumdare.com/", "title": "Ludum Dare"}
                    ]
                  },
                  {
                    "id": "5145",
                    "start": "13:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_13:23_-_quantify_the_world_-_tiefpunkt_-_5145",
                    "title": "Quantify the World",
                    "subtitle": "You want some measurements with that?",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": " Irgendwas über Sensoren, Daten, und was man damit so tun kann.",
                    "description": "",
                    "persons": [
                        {"id": "3920",  "full_public_name": "tiefpunkt"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5171",
                    "start": "14:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_14:23_-_open_data_in_deutschland_-_claudia_schwegmann_-_5171",
                    "title": "Open Data in Deutschland",
                    "subtitle": "Eine Übersicht zur politischen Situation in Deutschland, zum internaltionalen Kontext und zu konkreten Projekten",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "In diesem Vortrag wird der Stand der Open Data Bewegung in Deutschland vorgestellt: die rechtliche Situation, der bisherige politische Prozess und sowie der gegenwärtige Stand der Open Data Umsetzung durch staatlicher Behörden oder zivilgesellschaftlicher Initiativen. Um eine Einschätzung der Situation in Deutschland zu erleichtern werden auch Entwicklungen im internationalen Kontext kurz beschrieben.",
                    "description": "Die Open Knowledge Foundation Deutschland engagiert sich seit Jahren für Open Data in Deutschland. Im Gegensatz zu vielen anderen westlichen Ländern ist Open Data in Deutschland jedoch immer noch in den Kinderschuhen. Open Data steht nicht hoch auf der politischen Agenda und die konkreten Umsetzungen auf kommunaler, Landes- oder Bundesebene sind rar. 
Schwerpunkt des Vortrags ist ein Überblick über den aktuellen Stand von Open Data in Deutschland (rechtlich, politisch, Projekte). Die Situation in Deutschland wird dabei punktuell mit Entwicklungen im internationalen Kontext verglichen. Um eine Vorstellung zu den Anwendungsfeldern von Open Data zu geben, werden einige konkrete Projekte von Behörden und von der Open Knowledge Foundation vorgestellt. Abschließend werden die Forderungen der Netz Community zur Weiterentwicklung von Open Data in Deutschland zur Diskussion gestellt. ",
                    "persons": [
                        {"id": "3951",  "full_public_name": "Claudia Schwegmann"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5238",
                    "start": "15:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_15:23_-_scheitern_auf_hohem_niveau_warum_du_als_hacker_auf_jeden_keinen_fall_ein_startup_joinen_solltest_-_mntmn_-_5238",
                    "title": "Scheitern auf hohem Niveau: Warum du als Hacker auf jeden/keinen Fall ein Startup joinen solltest",
                    "subtitle": "(Was ich bei aka-aki lernte)",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "",
                    "abstract": "Aka-aki, gegründet 2007 von ein paar Studenten, millionenfinanziert, eins der ersten mobilen Social Networks mit über 700.000 Nutzern, am Ende grandios gescheitert: was war da los? Learnings aus der Perspektive eines Programmierers, der es von Anfang an mit aufbaute, und warum man es sich gut überlegen sollte, irgendwo für eine Beteiligung mitzuarbeiten.",
                    "description": "",
                    "persons": [
                        {"id": "3977",  "full_public_name": "mntmn"}
                    ],
                    "links": [
                        {"url": "http://www.spiegel.de/netzwelt/web/gescheitertes-start-up-der-tiefe-fall-von-aka-aki-a-887134.html", "title": "SPON: Aufstieg und Fall eines Start-ups: Am Boom gescheitert"}
                    ]
                  },
                  {
                    "id": "5182",
                    "start": "17:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_17:23_-_gp_gp_-_nuit_-_5182",
                    "title": "GP = GP",
                    "subtitle": "Die Jagd nach Pixel",
                    "track": "",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Software und Hardware Einsatz bei Panoramen, die 50 GP ueberschreiten.",
                    "description": "Am 6.3 entstand aus einem kleinen Test eines Panoramakopfes ein 4GP Bild. Seitdem sind wir auf der Suche nach noch mehr Pixeln.

Im Juli hatten wir endlich das erforderliche Wetter um unser 300mm Objektiv voll auszunutzen. Doch erreichten wir damit eine Bildgroesse zu der unsere Software und Hardware nur &quot;aeeehm, nope&quot; sagte. 

Rewrites aller Skripte und verbesserte Hardware musste her und vorallem eine Moeglichkeit Bilder vor dem eigentlichen Tiling und nach der Nachbearbeitung anzuschauen.
 
In dem Vortrag soll es um den Aufwand hinter einem Panorama gehen. Mit welcher Hardware wir gegen Waende liefen und an was man in der Nachbearbeitung nicht denken sollte.
",
                    "persons": [
                        {"id": "3458",  "full_public_name": "nuit"}
                    ],
                    "links": [
                        {"url": "http://gigapixel-bayreuth.de", "title": "62GP Bayreuth"}
                    ]
                  },
                  {
                    "id": "5150",
                    "start": "18:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_18:23_-_beruf_fluglotse_-_akiko_-_5150",
                    "title": "Beruf Fluglotse",
                    "subtitle": "",
                    "track": "Luftfahrt",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Wie sieht die Arbeit eines Fluglotsen aus?",
                    "description": "Wie funktioniert Flugsicherung? 
Aufgabe verschiedener Fluglotsen 
Luftraumstrukturen
fünfminütiger Film zur Darstellung eines Flugs 
Arbeitsalltag
Über die Deutsche Flugsicherung GmbH
Ausbildung und Berechtigungserhalt
Besondere Situationen
Diskussion/ Fragen",
                    "persons": [
                        {"id": "3922",  "full_public_name": "Akiko"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5160",
                    "start": "19:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_19:23_-_the_slingshot_channel_-_phanomen_oder_kalkul_-_jorg_sprave_-_5160",
                    "title": "&quot;The Slingshot Channel&quot; - Phänomen oder Kalkül?",
                    "subtitle": "Wie man mit Nischenthemen im Web erfolgreich sein kann",
                    "track": "",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Dieser Vortrag beschreibt die Geschichte und den Alltag eines der erfolgreichsten und gleichzeitig ungewöhnlichsten YouTube-Kanals Deutschland: Der &quot;Slingshot Channel&quot;. ",
                    "description": "Folgt!",
                    "persons": [
                        {"id": "3937",  "full_public_name": "Jörg Sprave"}
                    ],
                    "links": [
                        {"url": "http://www.youtube.com/user/JoergSprave", "title": "The Slingshot Channel auf YouTube"}
                    ]
                  },
                  {
                    "id": "5237",
                    "start": "20:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_20:23_-_wie_ich_23andme_debuggte_um_doch_keine_todliche_krankheit_zu_haben_-_mntmn_-_5237",
                    "title": "Wie ich 23andme debuggte, um doch keine tödliche Krankheit zu haben",
                    "subtitle": "(und was die Presse daraus machte)",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Die Geschichte vom Programmierfehler, der 23andme dazu veranlasste, mir die Erbkrankheit LGMD (Gliedergürteldystrophie) zu diagnostizieren. Wie ich den Fehler fand und sich die Presse darauf stürzte.",
                    "description": "",
                    "persons": [
                        {"id": "3977",  "full_public_name": "mntmn"}
                    ],
                    "links": [
                        {"url": "http://www.ctrl-verlust.net/23andme-wie-ich-fur-todkrank-erklart-wurde-und-mich-wieder-gesund-debuggte/", "title": "Original-Blogpost bei ctrl-verlust"}
                    ]
                  },
                  {
                    "id": "5151",
                    "start": "21:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_21:23_-_drohnendebatte_-_frank_-_5151",
                    "title": "Drohnendebatte",
                    "subtitle": "",
                    "track": "Quadrokopter / Dronen",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "1633",  "full_public_name": "frank"}
                    ],
                    "links": [
                    ]
                  }
              ],
              "Gate 111": [
                  {
                    "id": "5147",
                    "start": "11:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_11:23_-_gadgets_nicht_nur_aus_plastik_werkzeuge_mit_dem_3d-drucker_bauen_-_gonium_-_5147",
                    "title": "Gadgets nicht nur aus Plastik: Werkzeuge mit dem 3D-Drucker bauen",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Üblicherweise verwendet $Nerd einen FDM-basierten 3D-Drucker, sprich: Er kann Dinge aus ABS und PLA, vielleicht auch noch Nylon herstellen. Manchmal reicht das aber nicht: ABS ist zum Beispiel nicht lebensmittelecht - eine Schokoladenform will man daraus nicht herstellen. Der Vortrag zeigt, wie man über Bande spielen kann: Der Drucker wird für die Herstellung eines Werkzeuges benutzt, mit dem man dann andere Materialien formt. ",
                    "description": "",
                    "persons": [
                        {"id": "2461",  "full_public_name": "gonium"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5156",
                    "start": "12:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_12:23_-_wirtschaft_hacken_-_ewu_-_5156",
                    "title": "Wirtschaft hacken",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "wirtschaft ist (leider) mächtiger als politik. und sie bzw die menschen darin benehmen sich nicht gut, d.h. verteilen um von unten nach oben, machen die umwelt kaputt, sägen am datenschutz und so weiter. gefällt mir nicht. nur was tun? 

unser ansatz: rein ins system, schauen wie genau es funktioniert, und dann von innen heraus die dinge zum positiveren verbiegen. anti-mengenrabatt, umwelt-ausgleich, freiwilliges löschen von kundendaten, solche sachen. und das ganze mit einem freien (betriebs-)system, das cc-by-sa von jede_m kopierbar und nutzbar ist. wie das geht, warum es funktioniert, und was aktuelle entwicklungen sowie schwierigkeiten sind, darüber würde ich gern was erzählen. 

vortragen durfte ich schon in einigen hackerspaces, bei den letzten mrmcd war ich auch schon; der vortrag 2013 wäre also ähnlich, aber nicht gleich. ich würde die entwicklungen und den aktuellsten stand darstellen, genauer auf datenschutz und datennutzung eingehen, gern auch auf andere themenfelder die von den user_innen gewünscht werden. parallelen zur piratenpartei? postwachstums-ökonomie? rechtliche probleme? was ihr an einblicken in alternatives wirtschaften wollt. ",
                    "description": "",
                    "persons": [
                        {"id": "3395",  "full_public_name": "ewu"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5190",
                    "start": "13:23",
                    "duration": "03:00",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_13:23_-_ccc_regiotreffen_-_5190",
                    "title": "CCC Regiotreffen",
                    "subtitle": "",
                    "track": "",
                    "type": "meeting",
                    "language": "",
                    "abstract": "Regiotreffen des Chaos Computer Clubs",
                    "description": "",
                    "persons": [
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5176",
                    "start": "17:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_17:23_-_alice_und_bob_halten_das_maul_-_herr_urbach_-_5176",
                    "title": "Alice und Bob halten das Maul",
                    "subtitle": "Was tun bei Polizeikontrollen?",
                    "track": "Physical Security",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "Auf der GPN wurden ein paar auf einer Wiese sitzende Nerds und Nerdetten von der Polizei kontrolliert und es lief im Umgang mit dem Gewaltmonopol alles falsch, was falsch laufen kann. Das kann dramatische Konsequenzen haben. In diesem Workshop geht es um den &quot;richtigen&quot; Umgang, der nach einer kurzen Einführung in Rollenspielen geübt wird. ",
                    "description": "Fast jede Person glaubt zu wissen, wie mit Kontrollen durch die Polizei umzugehen ist - doch gibt es viele Fallstricke. In einer Mischung aus Vortrag und Workshop werden wir uns der Rechtslage annähern und in kleinen gestellten Polizeikontrollen üben, wie die Situation aufgelöst werden kann. 

ACHTUNG: Kann den Glauben in den Rechtsstaat erschüttern, immerhin geht es hier um den Umgang mit dem Gewaltmonopol. Am Ende steht halt dann doch meistens &quot;Ich verweigere die Aussage&quot; um sich selbst und die Peergroup zu schützen. 

Also, was kommt alles im Workshop dran? 

* Rechtliche Situation - Polizeigesetze der Länder und des Bundes, Verhältnis zueinander.
* Wie verhalte ich mich richtig? Wie schaffe ich es, dass meine Hardware bei mir bleibt und nicht in die Hände des Staatsapparats fällt?
* Was muss ich der Polizei sagen, was vorzeigen und was unterschreiben?
* Was mache ich als unbeteiligte Person, die zufällig anwesend ist?
* Polizei und Umgang auf Demonstrationen (z.B. FsA)
* Das Gewaltmonopol übt vor allem Gewalt aus - Discuss!",
                    "persons": [
                        {"id": "2929",  "full_public_name": "Herr Urbach"}
                    ],
                    "links": [
                        {"url": "http://www.rote-hilfe.de/downloads/category/5-broschueren?download=4:bitte-sagen-sie-jetzt-nichts-aussageverweigerung-und-verhoermethoden", "title": "Aussageverweigerung und Verhörmethoden (Rote Hilfe e.V.)"},
                        {"url": "http://www.gruene-jugend.de/sites/default/files/uploads/demofibel_kl_2.pdf", "title": "Demofibel der Grünen Jugend"}
                    ]
                  },
                  {
                    "id": "5155",
                    "start": "18:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_18:23_-_magnetringkernspeicher_-_grundlagen_und_aufbau_-_jochen_kunz_-_5155",
                    "title": "Magnetringkernspeicher - Grundlagen und Aufbau",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Der Mythos Magnetringkernspeicher: Viele kennen den nur Begriff, doch wie funktioniert Kernspeicher? Der Vortrag stellt kurz einige Vorgängertechnologien und deren Probleme vor, erklärt die (elektro)magnetischen Grundlagen und schließlich deren Anwendung zum Bau von Kernspeichern.",
                    "description": "Für die Computer der ersten Generation war Arbeitsspeicher, egal ob RAM oder Register ein großes Problem. Es existierten verschiedene Technologien, die aber entweder zu langsam, zu teuer, zu unzuverlässig, zu groß, ... waren. Erst Mitte der 50&#x27;er Jahre hatte man mit Magnetringkernspeicher eine leistungsfähige Technologie gefunden. Dabei wird jedes Bit Arbeitsspeicher durch einen winzigen Ring aus ferromagnetischem Material representiert, von Hand mit Drähten zu einer 3D Matrix gefädelt. Erst Mitte der 70&#x27;er Jahre kam die Ablösung durch Halbleiterspeicher. Bis heute haben sich aus dieser Zeit Begriffe wie &#x27;in Core&#x27; oder &#x27;Coredump&#x27; gehalten.

Der Vortrag stellt kurz einige Vorgängertechnologien und deren Probleme vor, erklärt die (elektro)magnetischen Grundlagen und schließlich deren Anwendung zum Bau von Kernspeichern.",
                    "persons": [
                        {"id": "3924",  "full_public_name": "Jochen Kunz"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5179",
                    "start": "19:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_19:23_-_why_are_gandhi_and_thoreau_afk_-_jan-peter_kleinhans_-_5179",
                    "title": "Why are Gandhi and Thoreau AFK?",
                    "subtitle": "In Search for Civil Disobedience online",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "en",
                    "abstract": "Do Distributed Denial-of-Service attacks constitute a valid form of civil disobedience online? Many hacktivists and hacker collectives see DDoS attacks as a form to promote their cause and to stage a &quot;virtual sit-in&quot; ... the talk investigates these claims from political and philosophical theory.",
                    "description": "I could present in both, German and English. I don&#x27;t mind. :) Since I am not a hacker myself I would be interested in opinions from the audience regarding DDoS attacks after my presentation. The underlying bigger question of the talk is: How to be civilly disobedient in cyberspace? What are other options next to DDoS attacks? I hope to provide a launching pad for a lively discussion. ",
                    "persons": [
                        {"id": "3962",  "full_public_name": "Jan-Peter Kleinhans"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5162",
                    "start": "20:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_20:23_-_prism_break_the_value_of_online_identities_-_frank_ackermann_-_5162",
                    "title": "Prism Break – the value of online identities",
                    "subtitle": "(de) or",
                    "track": "Anonymität im Real Life und außerhalb des Internets",
                    "type": "lecture",
                    "language": "en",
                    "abstract": "Online opinion making, blogging and journalism have developed to a
considerable market potential and source of revenue. With that online
identities have themselves become a valuable asset to possess – and thus target for theft and fraud. At the same time internet users willingly share detailed private data on social platforms, resulting in
in-depth-profiling and potential misuse.
This non-technical talk illustrates in an easily comprehensible way the value of online identities in our modern internet relying society. It
explains how information is processed, used and analyzed by internet platforms and how this opens vulnerabilities or fraudulent misuse.
Finally the talk supports the audience at reaching a better evaluation
of #Neuland&#x27;s territory in which Prism, search-engines, clouds and big data exists next door.

(Anmerkung: In Rücksprache mit den Anwesenden kann der Vortrag natürlich auch in Deutsch stattfinden ;-)",
                    "description": "",
                    "persons": [
                        {"id": "3939",  "full_public_name": "Frank Ackermann"}
                    ],
                    "links": [
                    ]
                  }
              ],
              "Gate 105 (Workshop Airlines)": [
                  {
                    "id": "5217",
                    "start": "11:23",
                    "duration": "01:30",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-07_11:23_-_einfuhrung_stickmaschine_-_jiska_-_5217",
                    "title": "Einführung Stickmaschine",
                    "subtitle": "Workshopreihe für Nährdinen und Nährds",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "Besticken und Motiverstellung",
                    "description": "In diesem Workshop bekommt ihr eine Einführung darüber, wie eine Stickmaschine funktioniert. Ihr bekommt gezeigt, welche Fäden wofür gedacht sind, welche Textilien sich wie besticken lassen, usw. Außerdem bekommt ihr gezeigt, was bei der Motivwahl zu beachten ist und wie man Stickdateien erstellt.

Stickgarn in über 120 Farben sowie einige Handtücher werden während der gesamten Veranstaltung vor Ort sein. Die neue Stickmaschine des RaumZeitLabors kann einen Bereich von bis zu 36x20cm besticken, also zum Beispiel die gesamte Rückseite eines Hoodies.

Natürlich könnt ihr auch eure eigenen Sachen besticken. Gut geeignet sind beispielsweise Labcoats, Handtücher sowie Hoodies und Pullover. Bei T-Shirts müsst ihr darauf achten, dass sie nicht aus zu dünnem Stoff sind, der sich zu stark dehnt (bei den typischen Herren-T-Shirts kein Problem).",
                    "persons": [
                        {"id": "3921",  "full_public_name": "jiska"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5220",
                    "start": "13:23",
                    "duration": "01:30",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-07_13:23_-_schneidplotter_und_shirtpresse_-_jiska_-_5220",
                    "title": "Schneidplotter und Shirtpresse ",
                    "subtitle": "Workshopreihe für Nährdinen und Nährds",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "Folien schneiden zum Bekleben von Notebooks, Bedrucken von Kleidung, ...",
                    "description": "In diesem Workshop bekommt ihr gezeigt, welche Folien es gibt und wofür sie sich eignen. Klebefolien gibt es beispielsweise für Notebooks, Autos, Fenster, ... Auch bei Shirtfolien sind die Anwendungsbereiche zahlreich.

Ihr bekommt gezeigt, was man bei der Motiverstellung beachten sollte. Ihr lernt, wie eine Shirtfolie aufgebaut ist, was der Schneidplotter da wie tief schneiden sollte und wie sie auf Shirts hält.

Folien für viele Anwendungsbereiche und in tollen Farben werden während der gesamten Veranstaltung vor Ort sein. Desweiteren gibt es einen Schneidplotter und eine Shirtpresse. T-Shirts in Standardgrößen (Herren und Damen) sowie verschiedenen Farben sind schon vorhanden. 

Natürlich könnt ihr auch eure eigenen Textilien mitbringen. Diese sollten bügelbar sein (bzw. ansonsten an einer verdeckten Stelle testbar).
Viele Textilien, die sich nicht für die Stickmaschine eignen, lassen sich trotzdem mit Folie bedrucken. Für alle Textilbegeisterten lohnt sich dieser Workshop also auch ;)",
                    "persons": [
                        {"id": "3921",  "full_public_name": "jiska"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5232",
                    "start": "15:23",
                    "duration": "00:50",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-07_15:23_-_key_signing_party_-_5232",
                    "title": "Key Signing Party",
                    "subtitle": "Join &amp; Strengthen the &quot;Web of Trust&quot;",
                    "track": "Web und IT-Security",
                    "type": "workshop",
                    "language": "",
                    "abstract": "Auf dem MRMCD2013 findet auch eine Key Signing Party statt, auch du kannst mitfliegen!",
                    "description": "Alle weiteren Infos unter: http://mrmcd.net/wiki/key_signing_party",
                    "persons": [
                    ],
                    "links": [
                        {"url": "http://mrmcd.net/wiki/key_signing_party", "title": "Alles weitere auf der Wikiseite"}
                    ]
                  },
                  {
                    "id": "5219",
                    "start": "17:23",
                    "duration": "02:00",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-07_17:23_-_nahmaschine_hoodies_-_jiska_-_5219",
                    "title": "Nähmaschine (Hoodies)",
                    "subtitle": "Workshopreihe für Nährdinen und Nährds",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "Hoodies - zum Wenden, mit tierischen Erweiterungen, ...",
                    "description": "Hier bekommt ihr gezeigt, wie man Hoodies näht oder bestehende Hoodies erweitert. Thematisiert werden:

&lt;ul&gt;
&lt;li&gt;Grundlegendes Schnittmuster für Hoodies&lt;/li&gt;
&lt;li&gt;Wendekleidung allgemein, wendbare Hoodies&lt;/li&gt;
&lt;li&gt;versteckte Taschen&lt;/li&gt;
&lt;li&gt;Ohren, Augen, usw. an der Kapuze annähen&lt;/li&gt;
&lt;li&gt;Flügel&lt;/li&gt;
&lt;/ul&gt;

...wer also schon immer mal einen warmen, kuscheligen Wendehoodie haben oder  seinen langweiligen grauen Hoodie in eine Katze oder einen Gameboy verwandeln wollte, ist hier genau richtig ;)


Für Tier-Hoodies bietet es sich an, den selben Hoodie zwei Mal zu kaufen und aus dem einen dann die Erweiterungen zu nähen, damit alles aus dem selben Stoff ist. Es sieht dann alles aus wie aus einem Stück und ihr müsst nicht einen kompletten Hoodie nähen.

Wer einen normalen Hoodie nähen möchte, bringt am besten eigenen Stoff mit. Für einen einlagigen Hoodie oder sehr warmen Wendehoodie eignet sich Sweat-Stoff, aber auch Jersey ist möglich. Für den Wendehoodie benötigt ihr außerdem einen wendbaren Reißverschluss.

Materialliste (bitte mitbringen):

&lt;ul&gt;
&lt;li&gt;1,50mx1,60m bis 2mx1,60m Sweatstoff in einer Farbe, z.B. schwarz, je nach Körpergröße (besser mehr)&lt;/li&gt;
&lt;li&gt;1,50mx1,60m bis 2mx1,60m Sweatstoff in einer anderen Farbe, z.B. blau, grau, rot, grün etc., wenn der Hoodie zum Wenden sein soll. Wenn der Hoodie nicht ganz so warm sein soll, reicht auch ein einfacher Baumwollstoff in einer anderen Farbe. (besser mehr)&lt;/li&gt;
&lt;li&gt;0,5m Bündchenstoff für Ärmel und untenrum&lt;/li&gt;
&lt;li&gt;einen Reißverschluss, ca. 70-80cm (kürzen kann man immer noch), ggf. als Wendereißverschluss (bekommt man auf eBay etc. günstig)&lt;/li&gt;
&lt;/ul&gt;

…und für die Katzen-, Drachen- und Pony-Freunde: wenn ihr etwas mehr Stoff bestellt sowie dicken Filz (gibt’s z.B. im Bastelzubehör), könnt ihr an den Hoodie auch plastische Ohren, Flügel, Mähnen, Schwänze, Pfoten, Stacheln usw. dran machen

Mehr Infos &lt;a href=&quot;http://nerdine.org/zenphoto/Wendehoodie/&quot;&gt;hier&lt;/a&gt;.",
                    "persons": [
                        {"id": "3921",  "full_public_name": "jiska"}
                    ],
                    "links": [
                    ]
                  }
              ]
            }
          },
          {
            "index": "2",
            "date": "2013-09-08",
            "rooms": {
              "Gate 104": [
                  {
                    "id": "5209",
                    "start": "11:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_11:23_-_hacking_medical_devices_-_flo_-_5209",
                    "title": "Hacking Medical Devices",
                    "subtitle": "",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "In den letzten Jahren sind immer mehr technologisch hochentwickelte medizinische Geräte auf den Markt gekommen. Diese Geräte haben mittlerweile vielfältige Kommunikationsmöglichkeiten. Wir befassen uns in einem Forschungsprojekt mit der Sicherheit dieser Geräte und werden den Stand unserer Arbeit in diesem Vortrag präsentieren.",
                    "description": "",
                    "persons": [
                        {"id": "3993",  "full_public_name": "flo"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5168",
                    "start": "12:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_12:23_-_frab_-_mm_-_5168",
                    "title": "frab",
                    "subtitle": "conference schedule management",
                    "track": "Open Source Entwicklung",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "frab wird auf verschiedenen chaos und chaosnahen Veranstaltungen genutzt um das Programm zu erstellen.

Der Vortrag geht auf die Verwendung und Entwicklung von frab ein. Zum Schluss wird die Club-weite Infrastruktur vorgestellt.",
                    "description": "Wie man frab benutzt um eine Veranstaltung zu planen, aber auch wie der derzeitige Entwicklungsstand ist. Welche Features sind geplant? Wie installiere ich frab? Welche Fehler gab es in der Vergangenheit. 
Was macht das CCC weite Frab und wie geht es mit der Integration von VOC und media weiter? ",
                    "persons": [
                        {"id": "1834",  "full_public_name": "mm"}
                    ],
                    "links": [
                        {"url": "https://github.com/frab/frab", "title": "frab"}
                    ]
                  },
                  {
                    "id": "5173",
                    "start": "13:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_13:23_-_proximax_telex_flashproxy_oder_tor_bridges_-_qbi_-_5173",
                    "title": "Proximax, Telex, Flashproxy oder Tor Bridges",
                    "subtitle": "Übersicht über aktuelle Zensurumgehungssoftware",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Zensur im Internet betrifft immer mehr Nutzer. Wir kennen Tools wie Proxies, VPNs oder Tor Bridges. Doch welche weiteren Werkzeuge unterstützen die Nutzer vor Ort? Wo sind die Stärken und Schwächen? Der Vortrag stellt einige von diesen vor und zeigt die Stärken und Schwächen.",
                    "description": "Der Vortrag versucht, einen Überblick über die öffentlich verfügbaren Zensurumgehungswerkzeuge zu geben und diese zu bewerten. Zu Anfang werden kurz mögliche, eher nichttechnische Wege angesprochen. Dann folgt eine Betrachtung von Haystack und Ultrasurf. Insbesondere gehe ich auf die spezifischen Fehler dieser Projekte ein. Einen ähnlichen Ansatz wie die beiden anderen Projekte verfolgt Psiphon. Die verschiedenen Versionen der Software werden kurz vorgestellt.

Später werde ich auf das Konzept der Tor Bridges eingehen. Dies ist wichtig, denn für diverse weitere Dienste ist dies die Grundlage. Insbesondere Proximax und die Flashproxies haben einen Bezug zu den Bridges. Telex.cc stellt den Abschluss der Erklärungen dar.

Der Vortrag stellt die Funktionsweise der diversen Dienste vor und erklärt, wo Stärken und Schwächen liegen. Ich würde mir erhoffen, dass der Vortrag für weitere neue Ansätze oder Verbesserungen der bestehenden Software dient.",
                    "persons": [
                        {"id": "2402",  "full_public_name": "qbi"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5241",
                    "start": "14:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_14:23_-_statistische_fallen_steller_-_khamacher_-_5241",
                    "title": "Statistische Fallen(steller)",
                    "subtitle": "",
                    "track": "Anonymität im Real Life und außerhalb des Internets",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Computerspiele führen zu Amokläufen? Vorratsdatenspeicherung &amp; Co sind Werkzeuge für &quot;Precrime&quot;? Päpste sind auch nur Menschen?",
                    "description": "Mit Statistik und daraus abgeleiteten Aussagen läßt sich viel &quot;argumentieren&quot; - auch und gerade im Bereich der Netze, Sicherheit und Überwachung.

Wie wir schon durch die linguistische Analyse des Neusprechs wissen, kann man mit geschickter Sprache viel manipulieren. Dieser Talk soll komplementär dazu zeigen, welche Manipulationen bzw. welche Fehler in der (öffentlichen) Diskussion bei empirischen Daten und ihrer statistischen Auswertung gemacht werden. Es liegt dabei im Auge des Betrachters, ob die Fehler intendiert sind oder nur aus Unkenntnis gemacht werden... ",
                    "persons": [
                        {"id": "2333",  "full_public_name": "khamacher"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5198",
                    "start": "15:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_15:23_-_mrmcd2013_brace_for_impact_-_unicorn_-_5198",
                    "title": "MRMCD2013: Brace for Impact",
                    "subtitle": "",
                    "track": "Luftfahrt",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "The world famous closing ceremony",
                    "persons": [
                        {"id": "1343",  "full_public_name": "Unicorn"}
                    ],
                    "links": [
                    ]
                  }
              ],
              "Gate 111": [
                  {
                    "id": "5149",
                    "start": "11:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-08_11:23_-_gemeinnutzigkeit_im_chaosumfeld_-_punktchen_-_5149",
                    "title": "Gemeinnützigkeit im Chaosumfeld",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "2491",  "full_public_name": "pünktchen"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5200",
                    "start": "12:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-08_12:23_-_run_your_own_f_cking_infrastructure_-_mc_fly_-_5200",
                    "title": "run your own f*cking infrastructure",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "en",
                    "abstract": "a rant that hackers nowerdays stopped running their own infrastructure.

It starts with email who has moved to gmail, with the websites that have moved to blogs, twitter and facebook.

This is a sad development and I think we should change that back.",
                    "description": "I will rant about those late developments of hackers not running their own stuff any and give a summary of reasons why we need to run our own infrastructure. I will give examples where in the short history of the clouds services have been compromised, shut down or taken over.

still a stub but i would like to meet submission deadline.",
                    "persons": [
                        {"id": "3858",  "full_public_name": "mc.fly"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5154",
                    "start": "13:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-08_13:23_-_calc_pw_-_kenneth_newwood_-_5154",
                    "title": "calc.pw",
                    "subtitle": "Passwortgenerierung mit Arduino",
                    "track": "Open Source Entwicklung",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Bei dem Vortrag geht es um mein neustes Projekt &quot;calc.pw&quot;, einer Open-Source Hardware zur Generierung von Passworten. Hierzu wird ein Masterpasswort und eine dienstabhängige Information verwendet, die anhand kryptographischer Methoden (Arc4 und SHA-1) zu einem Dienstpasswort überführt werden.

Das ganze ist mit Arduino-Hardware aufgebaut worden und kann mit Hilfe der zur Verfügung gestellten Aufbauinformationen und des Quelltextes, der unter GPLv3 steht, nachgebaut werden.

Im Vortag soll die Idee hinter calc.pw erklärt werden, es soll der Grund für die Veröffentlichung als Open-Source beleuchtet werden und es sollen die Besonderheiten der Einzelteile erklärt werden (Stichwort Key-Schedule des RC4, Stichwort Speichermanagent des ATMEL, etc.).

Weitere Informationen zum Projekt finden sich hier: http://calc.pw/de",
                    "description": "",
                    "persons": [
                        {"id": "3862",  "full_public_name": "Kenneth Newwood"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5191",
                    "start": "14:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-08_14:23_-_new_security_concepts_in_gnome_-_stef_walter_-_tobias_mueller_-_5191",
                    "title": "New Security Concepts in GNOME",
                    "subtitle": "More secure with less “security”",
                    "track": "Open Source Entwicklung",
                    "type": "lecture",
                    "language": "en",
                    "abstract": "The one big problem security faces is users. We interrupt users and and ask them to make informed decisions while they are trying to get things done. We must not prompt. Never. This talk shows some potential approaches and present infrastructure to make that happen.",
                    "description": "Application developers often regret having to deal with security stuff such as certificates or encryption.

This talk will show simple approaches to potentially take in GNOME to relieve app authors of so much security related complexity, while at the same time meeting user expectations of privacy.

Topics include:

    How to store account passwords in your configuration/settings  securely, even when your app is used in a (future) sandbox.
    The simple but correct way to use SSL/TLS to connect securely to online services.
    How to (not) deal with prompting the user about invalid certificates and so on.
    Using single sign on to remove prompting for passwords.

We’ll also highlight some of the infrastructure work that’s been done simplify security, such as the common storage for certificates, secret storage, authentication and so on.


",
                    "persons": [
                        {"id": "4005",  "full_public_name": "Stef Walter"},
                        {"id": "3980",  "full_public_name": "Tobias Mueller"}
                    ],
                    "links": [
                    ]
                  }
              ],
              "Gate 105 (Workshop Airlines)": [
              ]
            }
          }
      ]
    }
  }
}
