{ "schedule": {
    "version": "0",
    "conference": {
      "title": "MRMCD2013",
      "start": "2013-09-06",
      "end": "2013-09-08",
      "days": "3",
      "timeslot_duration": "00:10",
      "days": [
          {
            "index": "0",
            "date": "2013-09-06",
            "rooms": {
              "Gate 104": [
                  {
                    "id": "5167",
                    "start": "17:23",
                    "duration": "00:30",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-06_17:23_-_mrmcd2013_takeoff_-_unicorn_-_5167",
                    "title": "MRMCD2013: Takeoff",
                    "subtitle": "We wish you a pleasent journey",
                    "track": "Luftfahrt",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "1343",  "full_public_name": "Unicorn"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5171",
                    "start": "19:03",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-06_19:03_-_open_data_in_deutschland_-_claudia_schwegmann_-_5171",
                    "title": "Open Data in Deutschland",
                    "subtitle": "Eine Übersicht zur politischen Situation in Deutschland, zum internaltionalen Kontext und zu konkreten Projekten",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "In diesem Vortrag wird der Stand der Open Data Bewegung in Deutschland vorgestellt: die rechtliche Situation, der bisherige politische Prozess und sowie der gegenwärtige Stand der Open Data Umsetzung durch staatlicher Behörden oder zivilgesellschaftlicher Initiativen. Um eine Einschätzung der Situation in Deutschland zu erleichtern werden auch Entwicklungen im internationalen Kontext kurz beschrieben.",
                    "description": "Die Open Knowledge Foundation Deutschland engagiert sich seit Jahren für Open Data in Deutschland. Im Gegensatz zu vielen anderen westlichen Ländern ist Open Data in Deutschland jedoch immer noch in den Kinderschuhen. Open Data steht nicht hoch auf der politischen Agenda und die konkreten Umsetzungen auf kommunaler, Landes- oder Bundesebene sind rar. 
Schwerpunkt des Vortrags ist ein Überblick über den aktuellen Stand von Open Data in Deutschland (rechtlich, politisch, Projekte). Die Situation in Deutschland wird dabei punktuell mit Entwicklungen im internationalen Kontext verglichen. Um eine Vorstellung zu den Anwendungsfeldern von Open Data zu geben, werden einige konkrete Projekte von Behörden und von der Open Knowledge Foundation vorgestellt. Abschließend werden die Forderungen der Netz Community zur Weiterentwicklung von Open Data in Deutschland zur Diskussion gestellt. ",
                    "persons": [
                        {"id": "3951",  "full_public_name": "Claudia Schwegmann"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5196",
                    "start": "20:03",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-06_20:03_-_too-smart-tvs_-_erik_tews_-_5196",
                    "title": "Too-Smart-TVs",
                    "subtitle": "Wie intelligente Fernseher zum Zuschauertracking missbraucht werden.",
                    "track": "Anonymität im Real Life und außerhalb des Internets",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "1631",  "full_public_name": "erik.tews"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5199",
                    "start": "21:03",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-06_21:03_-_torservers_net_-_mo_-_5199",
                    "title": "Torservers.net",
                    "subtitle": "",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "2633",  "full_public_name": "mo"}
                    ],
                    "links": [
                    ]
                  }
              ],
              "Gate 111": [
                  {
                    "id": "5152",
                    "start": "19:03",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-06_19:03_-_content_security_policy_-_ein_weiterer_vergeblicher_versuch_cross-site_scripting_zu_bandigen_-_sbieber_-_5152",
                    "title": " Content Security Policy - Ein weiterer (vergeblicher) Versuch Cross-Site Scripting zu bändigen?",
                    "subtitle": "",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Cross-Site Scripting (XSS) Schwachstellen sind in der OWASP TOP 10 der Jahre 2010 und 2013 auf Platz 2 bzw. 3. Die Behebung solcher Schwachstellen ist bis heute trotz Hilfsmitteln noch sehr unzuverlässig. Content Security Policy (=CSP) ist eine im Browser implementierte Schutzfunktion, um die Gefahr XSS auf Seiten der Clients einzudämmen. Mithilfe der CSP ist es möglich, dem Browser erlaubte Quellen für eingebundene Skript- oder Medien-Inhalte (z. B. &lt;scrip&gt;, &lt;img&gt;, &lt;object&gt;) zu definieren. In diesem Vortrag wird die Entstehung, sowie der technische Hintergrund der CSP erklärt. Dabei werden die wichtigsten Restriktionsparameter für eine Live-Demonstration herausgepickt und erläutert. Es wird ein Lösungsansatz aufgezeigt, wie man CSP in die eigene Webapplikation integrieren kann und dabei Probleme des CSP-Designs erläutert. ",
                    "description": "",
                    "persons": [
                        {"id": "3923",  "full_public_name": "sbieber"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5157",
                    "start": "21:03",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-06_21:03_-_bausatze_in_hackerspaces_-_muzy_-_5157",
                    "title": "Bausätze in Hackerspaces",
                    "subtitle": "Von der Idee zur Einnahmequelle",
                    "track": "Open Source Entwicklung",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "An langen Abenden in Hackerspaces bilden sich viele Projektideen. Einige werden sofort wieder verworfen, andere wiederum werden sofort realisiert. Mit viel Motivation entsteht aus einer Idee ein fertiges Produkt. Doch wie kann man damit seinen Hackerspace unterstützen? 
",
                    "description": "Wie wärs mit einem Bausatz? Wie man Bausätze erstellt, was man beachten sollte und welche Probleme sich in den Weg stellen können sind Inhalt des Vortrags. Hintergrundinformationen zu bereits abgeschlossenen Bausatzprojekten wie das Hacklace sind im ebenso im Fokus wie allgemeine Tipps und Tricks zu einem tollen Bausatz.

Einen kleinen Ausblick auf die Inhalte gibt es bereits im RaumZeitLabor Blog (siehe verlinkte Website). 
",
                    "persons": [
                        {"id": "3878",  "full_public_name": "muzy"}
                    ],
                    "links": [
                        {"url": "http://hacklace.org", "title": "Hacklace Website"},
                        {"url": "https://raumzeitlabor.de/blog/wie-man-einen-bausatz-bastelt/", "title": "Wie man einen Bausatz bastelt"}
                    ]
                  }
              ],
              "Gate 105 (Workshop Airlines)": [
              ]
            }
          },
          {
            "index": "1",
            "date": "2013-09-07",
            "rooms": {
              "Gate 104": [
                  {
                    "id": "5156",
                    "start": "11:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_11:23_-_wirtschaft_hacken_-_ewu_-_5156",
                    "title": "Wirtschaft hacken",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "wirtschaft ist (leider) mächtiger als politik. und sie bzw die menschen darin benehmen sich nicht gut, d.h. verteilen um von unten nach oben, machen die umwelt kaputt, sägen am datenschutz und so weiter. gefällt mir nicht. nur was tun? 

unser ansatz: rein ins system, schauen wie genau es funktioniert, und dann von innen heraus die dinge zum positiveren verbiegen. anti-mengenrabatt, umwelt-ausgleich, freiwilliges löschen von kundendaten, solche sachen. und das ganze mit einem freien (betriebs-)system, das cc-by-sa von jede_m kopierbar und nutzbar ist. wie das geht, warum es funktioniert, und was aktuelle entwicklungen sowie schwierigkeiten sind, darüber würde ich gern was erzählen. 

vortragen durfte ich schon in einigen hackerspaces, bei den letzten mrmcd war ich auch schon; der vortrag 2013 wäre also ähnlich, aber nicht gleich. ich würde die entwicklungen und den aktuellsten stand darstellen, genauer auf datenschutz und datennutzung eingehen, gern auch auf andere themenfelder die von den user_innen gewünscht werden. parallelen zur piratenpartei? postwachstums-ökonomie? rechtliche probleme? was ihr an einblicken in alternatives wirtschaften wollt. ",
                    "description": "",
                    "persons": [
                        {"id": "3395",  "full_public_name": "ewu"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5143",
                    "start": "12:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_12:23_-_flugzeugtechnik_-_matthias_-_5143",
                    "title": "Flugzeugtechnik",
                    "subtitle": "",
                    "track": "",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "3913",  "full_public_name": "Matthias"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5162",
                    "start": "13:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_13:23_-_prism_break_the_value_of_online_identities_-_frank_ackermann_-_5162",
                    "title": "Prism Break – the value of online identities",
                    "subtitle": "",
                    "track": "Anonymität im Real Life und außerhalb des Internets",
                    "type": "lecture",
                    "language": "en",
                    "abstract": "Online opinion making, blogging and journalism have developed to a
considerable market potential and source of revenue. With that online
identities have themselves become a valuable asset to possess – and thus target for theft and fraud. At the same time internet users willingly share detailed private data on social platforms, resulting in
in-depth-profiling and potential misuse.
This non-technical talk illustrates in an easily comprehensible way the value of online identities in our modern internet relying society. It
explains how information is processed, used and analyzed by internet platforms and how this opens vulnerabilities or fraudulent misuse.
Finally the talk supports the audience at reaching a better evaluation
of #Neuland&#x27;s territory in which Prism, search-engines, clouds and big data exists next door.",
                    "description": "",
                    "persons": [
                        {"id": "3939",  "full_public_name": "Frank Ackermann"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5145",
                    "start": "14:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_14:23_-_quantify_the_world_-_tiefpunkt_-_5145",
                    "title": "Quantify the World",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "3920",  "full_public_name": "tiefpunkt"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5182",
                    "start": "15:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_15:23_-_gigapix_gigaproblems_-_nuit_-_5182",
                    "title": "Gigapix = Gigaproblems?",
                    "subtitle": "",
                    "track": "",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Ein kurzer Exkurs in die Welt der grossen Panoramen. Was fuer Probleme treten bei Bildern die die 50GP Marke ueberschreiten auf und womit verarbeitet man eigentlich die Datenmenge?",
                    "description": "",
                    "persons": [
                        {"id": "3458",  "full_public_name": "nuit"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5181",
                    "start": "17:13",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_17:13_-_ipsec_how_to_use_vpn_with_enterprise_hardware_-_progamler_-_5181",
                    "title": "IPSEC How to use VPN with Enterprise Hardware",
                    "subtitle": "",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "In dem Vortrag werden Grundlagen von IPSEC erklaert",
                    "description": "Geschichte

    Standards
        rfc2401 Security Architecture for the Internet Protocol (November 1998)
        rfc2402 IP Authentication Header (November 1998)
        rfc2403 The Use of HMAC-MD5-96 within ESP and AH (November 1998 )
        rfc2405 The Use of HMAC-SHA-1-96 within ESP and AH (November 1998 )
        rfc2406 IP Encapsulating Security Payload (ESP) (November 1998 )
        rfc2408 Internet Security Association and Key Management Protocol (ISAKMP) (November 1998 )
        rfc2409 The Internet Key Exchange (IKE) (November 1998 )
        rfc2412 The OAKLEY Key Determination Protocol (November 1998 )
    Funktionen
        Encryption of user data for privacy.
        Authentication of the integrity of a message to ensure that it is not changed en route.
        Protection against certain types of security attacks, such as replay attacks.
        The ability for devices to negotiate the security algorithms and keys required to meet their security needs.
        Two security modes, tunnel and transport, to meet different network needs.

Übliche Umsetzung

    Site-to-Site
        192.168.1.0/24 &lt;-&gt; 172.16.0.0/16
        192.168.1.0/24 &lt;-&gt; 0.0.0.0/0
        192.168.1.0/24 &lt;-&gt; 31.172.42.0/24
    Site-to-Client
        0.0.0.0/0 &lt;-&gt; 192.168.1.23/32
        172.16.0.0/12 &lt;-&gt; 192.168.1.42/32
        31.172.42.0/24 &lt;-&gt; 192.168.1.42/32
    Server-to-Client
        172.16.23.42/32 &lt;-&gt; 192.168.1.54/32
        31.172.42.85/32 &lt;-&gt; 192.168.1.54/32
    Server-to-Server
        172.16.23.42/32 &lt;-&gt; 10.42.23.54/32
        31.172.42.85/32 &lt;-&gt; 195.160.168.28/32

Modes

    Tunnel

        Im Tunnelmodus wird das ursprüngliche Paket gekapselt und die Sicherheitsdienste von IPsec auf das gesamte Paket angewandt. Der neue (äußere) IP-Header dient dazu, die Tunnelenden (also die kryptografischen Endpunkte) zu adressieren, während die Adressen der eigentlichen Kommunikationsendpunkte im inneren IP-Header stehen. Der ursprüngliche (innere) IP-Header stellt für Router usw. auf dem Weg zwischen den Tunnelenden nur Nutzlast (Payload) dar und wird erst wieder verwendet, wenn das empfangende Security-Gateway (das Tunnelende auf der Empfangsseite) die IP-Kapselung entfernt hat und das Paket dem eigentlichen Empfänger zustellt.

        Im Tunnelmodus sind Gateway-zu-Gateway- oder auch Peer-zu-Gateway-Verbindungen möglich. Da an jeweils einer Seite Tunnelende und Kommunikationsendpunkt auf demselben Rechner zusammenfallen können, sind auch im Tunnelmodus Peer-zu-Peer-Verbindungen möglich. Ein Vorteil des Tunnelmodus ist, dass bei der Gateway-zu-Gateway-Verbindung nur in die Gateways (Tunnelenden) IPsec implementiert und konfiguriert werden muss. Angreifer können dadurch nur die Tunnelendpunkte des IPsec-Tunnels feststellen, nicht aber den gesamten Weg der Verbindung.
        Gliffy 
    Transport
        Im Transportmodus wird der IPsec-Header zwischen dem IP-Header und den Nutzdaten eingefügt. Der IP-Header bleibt unverändert und dient weiterhin zum Routing des Pakets vom Sender zum Empfänger. Der Transportmodus wird verwendet, wenn die „kryptographischen Endpunkte“ auch die „Kommunikations-Endpunkte“ sind. Nach dem Empfang des IPsec-Paketes werden die ursprünglichen Nutzdaten (TCP/UDP-Pakete) ausgepackt und an die höherliegende Schicht weitergegeben. Der Transportmodus wird vor allem für Host-zu-Host- oder Host-zu-Router-Verbindungen verwendet, z.B. für die Netzwerkverwaltung.
    ESP
        Encapsulating Security Payload (ESP) stellt Mechanismen zur Sicherstellung der Authentizität, Integrität und Vertraulichkeit der übertragenen IP-Pakete bereit. Im Unterschied zum AH wird der Kopf des IP-Paketes vom ICV (Integrity check value) nicht berücksichtigt, jedoch werden die Nutzdaten verschlüsselt übertragen. ESP basiert direkt auf IP und verwendet die IP-Protokoll Nummer 50.
    AH
        Der Authentication Header (AH) soll die Authentizität und Integrität der übertragenen Pakete sicherstellen und den Sender authentisieren. Weiterhin schützt er gegen Replay-Angriffe. AH schützt die invarianten Teile eines IP-Datagramms; IP-Header-Felder, die auf dem Weg durch ein IP-Netz von Routern verändert werden können (z. B. TTL), werden nicht berücksichtigt. Werden auf dem Weg durch das Netz Router mit aktivierter Network Address Translation (NAT) passiert, so ändern diese die eigentlich invarianten Teile eines IP-Datagramms ab, folglich ist eine Authentisierung nicht mehr möglich - NAT und AH sind folglich designbedingt inkompatibel - lediglich eine Kombination von NAT und ESP (siehe RFC 3948 – UDP Encapsulation of IPsec ESP Packets) ist möglich. Die Nutzdaten werden bei AH nicht verschlüsselt und sind damit für jeden lesbar. AH basiert direkt auf IP und verwendet die IP-Protokoll Nummer 51.

Umsetzung

    Policy-Based
        Kompatibel zu fast allen Geräten, genaue Beschreibung wer mit wem reden darf
        Src-IP,Dst-IP,Dst-Port
        192.168.1.25, 172.16.25.42, 3306
    Route-based
        Es gibt ein interface auf das geroutet wird, erlaubt ist alles im Tunnnel und kann durch uebliche Instrumente wie Firewalls/Access-Listen eingeschraenkt werden
        0.0.0.0/0, 0.0.0.0/0, Any

Crypto

    des
    3des
    aes128
    aes256

Config exampels
IPSEC (linux, juniper, netgear, fritzbox)
IPSEC+GRE",
                    "persons": [
                        {"id": "3964",  "full_public_name": "proGamler"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5150",
                    "start": "18:13",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_18:13_-_beruf_fluglotse_-_akiko_-_5150",
                    "title": "Beruf Fluglotse",
                    "subtitle": "",
                    "track": "Luftfahrt",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Wie sieht die Arbeit eines Fluglotsen aus?",
                    "description": "Wie funktioniert Flugsicherung? 
Aufgabe verschiedener Fluglotsen 
Luftraumstrukturen
fünfminütiger Film zur Darstellung eines Flugs 
Arbeitsalltag
Über die Deutsche Flugsicherung GmbH
Ausbildung und Berechtigungserhalt
Besondere Situationen
Diskussion/ Fragen",
                    "persons": [
                        {"id": "3922",  "full_public_name": "Akiko"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5160",
                    "start": "19:13",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_19:13_-_the_slingshot_channel_-_phanomen_oder_kalkul_-_jorg_sprave_-_5160",
                    "title": "&quot;The Slingshot Channel&quot; - Phänomen oder Kalkül?",
                    "subtitle": "Wie man mit Nischenthemen im Web erfolgreich sein kann",
                    "track": "",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Dieser Vortrag beschreibt die Geschichte und den Alltag eines der erfolgreichsten und gleichzeitig ungewöhnlichsten YouTube-Kanals Deutschland: Der &quot;Slingshot Channel&quot;. ",
                    "description": "Folgt!",
                    "persons": [
                        {"id": "3937",  "full_public_name": "Jörg Sprave"}
                    ],
                    "links": [
                        {"url": "http://www.youtube.com/user/JoergSprave", "title": "The Slingshot Channel auf YouTube"}
                    ]
                  },
                  {
                    "id": "5151",
                    "start": "20:13",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-07_20:13_-_drohnendebatte_-_frank_-_5151",
                    "title": "Drohnendebatte",
                    "subtitle": "",
                    "track": "Quadrokopter / Dronen",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "1633",  "full_public_name": "frank"}
                    ],
                    "links": [
                    ]
                  }
              ],
              "Gate 111": [
                  {
                    "id": "5147",
                    "start": "11:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_11:23_-_gadgets_nicht_nur_aus_plastik_werkzeuge_mit_dem_3d-drucker_bauen_-_gonium_-_5147",
                    "title": "Gadgets nicht nur aus Plastik: Werkzeuge mit dem 3D-Drucker bauen",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Üblicherweise verwendet $Nerd einen FDM-basierten 3D-Drucker, sprich: Er kann Dinge aus ABS und PLA, vielleicht auch noch Nylon herstellen. Manchmal reicht das aber nicht: ABS ist zum Beispiel nicht lebensmittelecht - eine Schokoladenform will man daraus nicht herstellen. Der Vortrag zeigt, wie man über Bande spielen kann: Der Drucker wird für die Herstellung eines Werkzeuges benutzt, mit dem man dann andere Materialien formt. ",
                    "description": "",
                    "persons": [
                        {"id": "2461",  "full_public_name": "gonium"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5153",
                    "start": "12:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_12:23_-_android_hacking_lab_-_sbieber_-_5153",
                    "title": "Android Hacking Lab",
                    "subtitle": "",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Laut einer aktuellen Studie von Kaspersky (in 2013) wird 99,9% der neu entwickelten Malware bei Mobilgeräten für Geräte auf Basis des Betriebssystems Android entwickelt. Dieser Vortrag beschäftigt sich mit der Überprüfung der Sicherheit von Android-Applikationen. Um die Sicherheitsuntersuchung von Android-Applikationen zu veranschaulichen, werden Methoden und Vorgehensweisen, mögliche Tools, tückische Hürden und Fallstricke beim Aufbau der Untersuchungsumgebung vorgestellt. Dies wird abschließend anhand der bereits betriebenen Forschung mittels bereits gefundener und von Herstellern behobener Schwachstellen konkretisiert. ",
                    "description": "",
                    "persons": [
                        {"id": "3923",  "full_public_name": "sbieber"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5190",
                    "start": "13:23",
                    "duration": "03:00",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_13:23_-_ccc_regiotreffen_-_5190",
                    "title": "CCC Regiotreffen",
                    "subtitle": "",
                    "track": "",
                    "type": "meeting",
                    "language": "",
                    "abstract": "Regiotreffen des Chaos Computer Clubs",
                    "description": "",
                    "persons": [
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5176",
                    "start": "17:13",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_17:13_-_alice_und_bob_halten_das_maul_-_herr_urbach_-_5176",
                    "title": "Alice und Bob halten das Maul",
                    "subtitle": "Was tun bei Polizeikontrollen?",
                    "track": "Physical Security",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "Auf der GPN wurden ein paar auf einer Wiese sitzende Nerds und Nerdetten von der Polizei kontrolliert und es lief im Umgang mit dem Gewaltmonopol alles falsch, was falsch laufen kann. Das kann dramatische Konsequenzen haben. In diesem Workshop geht es um den &quot;richtigen&quot; Umgang, der nach einer kurzen Einführung in Rollenspielen geübt wird. ",
                    "description": "Fast jede Person glaubt zu wissen, wie mit Kontrollen durch die Polizei umzugehen ist - doch gibt es viele Fallstricke. In einer Mischung aus Vortrag und Workshop werden wir uns der Rechtslage annähern und in kleinen gestellten Polizeikontrollen üben, wie die Situation aufgelöst werden kann. 

ACHTUNG: Kann den Glauben in den Rechtsstaat erschüttern, immerhin geht es hier um den Umgang mit dem Gewaltmonopol. Am Ende steht halt dann doch meistens &quot;Ich verweigere die Aussage&quot; um sich selbst und die Peergroup zu schützen. 

Also, was kommt alles im Workshop dran? 

* Rechtliche Situation - Polizeigesetze der Länder und des Bundes, Verhältnis zueinander.
* Wie verhalte ich mich richtig? Wie schaffe ich es, dass meine Hardware bei mir bleibt und nicht in die Hände des Staatsapparats fällt?
* Was muss ich der Polizei sagen, was vorzeigen und was unterschreiben?
* Was mache ich als unbeteiligte Person, die zufällig anwesend ist?
* Polizei und Umgang auf Demonstrationen (z.B. FsA)
* Das Gewaltmonopol übt vor allem Gewalt aus - Discuss!",
                    "persons": [
                        {"id": "2929",  "full_public_name": "Herr Urbach"}
                    ],
                    "links": [
                        {"url": "http://www.rote-hilfe.de/downloads/category/5-broschueren?download=4:bitte-sagen-sie-jetzt-nichts-aussageverweigerung-und-verhoermethoden", "title": "Aussageverweigerung und Verhörmethoden (Rote Hilfe e.V.)"}
                    ]
                  },
                  {
                    "id": "5155",
                    "start": "18:13",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_18:13_-_magnetringkernspeicher_-_grundlagen_und_aufbau_-_jochen_kunz_-_5155",
                    "title": "Magnetringkernspeicher - Grundlagen und Aufbau",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Der Mythos Magnetringkernspeicher: Viele kennen den nur Begriff, doch wie funktioniert Kernspeicher? Der Vortrag stellt kurz einige Vorgängertechnologien und deren Probleme vor, erklärt die (elektro)magnetischen Grundlagen und schließlich deren Anwendung zum Bau von Kernspeichern.",
                    "description": "Für die Computer der ersten Generation war Arbeitsspeicher, egal ob RAM oder Register ein großes Problem. Es existierten verschiedene Technologien, die aber entweder zu langsam, zu teuer, zu unzuverlässig, zu groß, ... waren. Erst Mitte der 50&#x27;er Jahre hatte man mit Magnetringkernspeicher eine leistungsfähige Technologie gefunden. Dabei wird jedes Bit Arbeitsspeicher durch einen winzigen Ring aus ferromagnetischem Material representiert, von Hand mit Drähten zu einer 3D Matrix gefädelt. Erst Mitte der 70&#x27;er Jahre kam die Ablösung durch Halbleiterspeicher. Bis heute haben sich aus dieser Zeit Begriffe wie &#x27;in Core&#x27; oder &#x27;Coredump&#x27; gehalten.

Der Vortrag stellt kurz einige Vorgängertechnologien und deren Probleme vor, erklärt die (elektro)magnetischen Grundlagen und schließlich deren Anwendung zum Bau von Kernspeichern.",
                    "persons": [
                        {"id": "3924",  "full_public_name": "Jochen Kunz"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5179",
                    "start": "19:13",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-07_19:13_-_why_are_gandhi_and_thoreau_afk_-_jan-peter_kleinhans_-_5179",
                    "title": "Why are Gandhi and Thoreau AFK?",
                    "subtitle": "In Search for Civil Disobedience online",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "en",
                    "abstract": "Do Distributed Denial-of-Service attacks constitute a valid form of civil disobedience online? Many hacktivists and hacker collectives see DDoS attacks as a form to promote their cause and to stage a &quot;virtual sit-in&quot; ... the talk investigates these claims from political and philosophical theory.",
                    "description": "I could present in both, German and English. I don&#x27;t mind. :) Since I am not a hacker myself I would be interested in opinions from the audience regarding DDoS attacks after my presentation. The underlying bigger question of the talk is: How to be civilly disobedient in cyberspace? What are other options next to DDoS attacks? I hope to provide a launching pad for a lively discussion. ",
                    "persons": [
                        {"id": "3962",  "full_public_name": "Jan-Peter Kleinhans"}
                    ],
                    "links": [
                    ]
                  }
              ],
              "Gate 105 (Workshop Airlines)": [
                  {
                    "id": "5148",
                    "start": "11:23",
                    "duration": "00:50",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-07_11:23_-_workshopreihe_fur_nahrds_und_nahrdinen_stickmaschine_schneidplotter_shirtpresse_nahmaschine_-_jiska_-_5148",
                    "title": "Workshopreihe für Nährds und Nährdinen (Stickmaschine, Schneidplotter/Shirtpresse, Nähmaschine)",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "3921",  "full_public_name": "jiska"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5203",
                    "start": "12:23",
                    "duration": "04:00",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-07_12:23_-_arduino_fur_anfanger_-_muzy_-_5203",
                    "title": "Arduino für Anfänger",
                    "subtitle": "Löten, blinken und die Welt verändern",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "",
                    "description": "Du willst löten lernen? Kenntnisse vertiefen oder einfach mal wieder in netter Gesellschaft löten? Dann ist dieser Workshop genau das richtige für Dich!

&lt;b&gt;Was?&lt;/b&gt;

Wir löten gemeinsam einen Arduino-UNO kompatiblen Playduino One. Vorher lernst Du gemeinsam mit anderen Workshopteilnehmern die wichtigsten Löttechniken. Die Arduino-Plattform ist eine Microcontroller-Plattform für Einsteiger und Fortgeschrittene. Eine einfach erlernbare Programmiersprache mit vielen Funktionen läd zum programmieren ein – die ausgeklügelte Hardware ermöglicht auch Anfängern schnelle Erfolge!

Ist Dein eigenes Board erst gelötet werden wir das Board gemeinsam in Betrieb nehmen und wenn nötig noch einige Stellen verbessern. Zusätzlich unterstützen wir Dich dein erstes kleines Programm zu schreiben und die Möglichkeiten der Arduino-Plattform zu entdecken! Dazu haben wir dir auch noch ein Breadboard, coole Sensoren und andere Elektronikbauteile zusammengestellt :)

&lt;b&gt;Was muss du mitbringen?&lt;/b&gt;

So gut wie nichts! Wir bereiten alles für Dich vor, hauptsache Du bist anwesend! Vorwissen ist nicht notwendig; der Workshop richtet sich an Jugendliche und Erwachsene. Wir empfehlen dein Notebook mitzubringen damit Du die Arduino-Entwicklungsumgebung installieren kannst um direkt mit deinem Arduino zu experimentieren.

Werkzeuge und Lötutensilien sind zum Workshop vorhanden. Wenn Du magst kannst Du allerdings Deine eigene Lötstation oder Deinen eigenen Lötkolben mitbringen.

&lt;b&gt;Kosten&lt;/b&gt;

Um das Verbrauchsmaterial und die Bausatzteile zu finanzieren, müssen wir einen kleinen Unkostenbeitrag erheben. Dieser beträgt 40€ pro Person und ist zum Workshop mitzubringen. Bitte sei 5 Minuten vor Workshopbeginn vor Ort, damit wir pünktlich starten lönnen.

Note for English speakers: Even though this workshop is delivered in German we can arrange a workshop in English. Please drop me a line at muzy [here comes the at sign] hacklace [here comes the dot] and the ORG and we will figure out a solution.",
                    "persons": [
                        {"id": "3878",  "full_public_name": "muzy"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5202",
                    "start": "17:13",
                    "duration": "02:00",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-07_17:13_-_hacklace_lotworkshop_-_muzy_-_5202",
                    "title": "Hacklace Lötworkshop",
                    "subtitle": "Wir löten ein blinkendes Schmuckstück",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "Mit dem Hacklace bastelst du dir dein eigenes blinkendes Schmuckstück und lernst dabei spielend einfach Löten. Fertig zusammengebaut kannst du es wie eine Halskette tragen und auf 35 Pixeln kreativ werden - mit deinen eigenen Texten und Animationen",
                    "description": "Noch nie gelötet? Kein Problem. Mit dem Hacklace lernst du spielend einfach löten und hast am Ende ein tolles elektronisches Schmuckstück.

Egal ob auf Parties und in Clubs - mit dem Hacklace setzt du ein leuchtendes Zeichen und bist ein Blickfang. Alternativ auch ein tolles unkonventionelles Geschenk mit deiner Individuellen Botschaft,

Die individuelle Botschaft bekommst du ganz einfach auf dein Hacklace. Mit einem USB-&gt;TTL Adapter an deinen PC anschließen und den Animator auf http://hacklace,org herunterladen und ausführen. Mit nur wenigen Klicks hast du neue Animationen und Texte auf deinem Hacklace! :)

Es fällt bei dem Workshop ein Unkostenbeitrag für 13€ (nur Hacklace) bzw 18€ (Hacklace und USB-&gt;TTL Adapter) an. Bitte bringe diesen Unkostenbeitrag passend zum Workshop mit. Lötutensilien bringen wir mit, wenn du aber mit deinem eigenem Werkzeug löten willst kannst du das natürlich gerne machen!

Benötigst du keinen Workshop und möchtest für dich alleine ein Hacklace löten, kannst du einen Bausatz für den regulären Preis von 10€ erwerben (USB-&gt;TTL Adapter für 5€). 


Note for English speakers: Even though this workshop is delivered in German we can arrange a workshop in English. Please drop me a line at  muzy [here comes the at sign] hacklace [here comes the dot] and the ORG and we will figure out a solution.",
                    "persons": [
                        {"id": "3878",  "full_public_name": "muzy"}
                    ],
                    "links": [
                        {"url": "http://hacklace.org", "title": "Hacklace Website"}
                    ]
                  },
                  {
                    "id": "5201",
                    "start": "19:13",
                    "duration": "02:00",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-07_19:13_-_let_s_blink_-_muzy_-_5201",
                    "title": "Let&#x27;s blink ",
                    "subtitle": "SMD-Lötlern Workshop mit dem RZLblink",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "",
                    "description": "SMD löten - oft als schwierig abgetan aber eigentlich kinderleicht. In diesem Workshop lernst Du anhand des RZLblink, dass auch Du SMD löten kannst. 

Der Workshop dauert in etwa zwei Stunden, Material wird bereitgestellt. Wenn du deinen eigenen Lötkolben nutzen möchtest bringe diesen ruhig mit. Für den Workshop fällt ein Unkostenbeitrag von 13€ pro Workshopteilnehmer an. Bitte finde dich fünf Minuten vor dem Workshop im Workshop-Raum ein, damit wir pünktlich starten können.

Benötigst du keinen Workshop und möchtest für dich alleine ein RZLblink löten, kannst du einen Bausatz für den regulären Preis von 8€ erwerben. 


Note for English speakers: Even though this workshop is delivered in German we can arrange a workshop in English. Please drop me a line at  muzy [here comes the at sign] hacklace [here comes the dot] and the ORG and we will figure out a solution.",
                    "persons": [
                        {"id": "3878",  "full_public_name": "muzy"}
                    ],
                    "links": [
                        {"url": "https://wiki.raumzeitlabor.de/wiki/RZLblink", "title": "RZLblink im RaumZeitLabor Wiki"}
                    ]
                  }
              ]
            }
          },
          {
            "index": "2",
            "date": "2013-09-08",
            "rooms": {
              "Gate 104": [
                  {
                    "id": "5168",
                    "start": "12:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_12:23_-_frab_-_mm_-_5168",
                    "title": "frab",
                    "subtitle": "conference hacking",
                    "track": "Open Source Entwicklung",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Mein Leben mit frab: Rückblicke, Ausblicke.",
                    "description": "
",
                    "persons": [
                        {"id": "1834",  "full_public_name": "mm"}
                    ],
                    "links": [
                        {"url": "https://github.com/frab/frab", "title": "frab"}
                    ]
                  },
                  {
                    "id": "5173",
                    "start": "13:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_13:23_-_proximax_telex_flashproxy_oder_tor_bridges_-_qbi_-_5173",
                    "title": "Proximax, Telex, Flashproxy oder Tor Bridges",
                    "subtitle": "Übersicht über aktuelle Zensurumgehungssoftware",
                    "track": "Web und IT-Security",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Zensur im Internet betrifft immer mehr Nutzer. Wir kennen Tools wie Proxies, VPNs oder Tor Bridges. Doch welche weiteren Werkzeuge unterstützen die Nutzer vor Ort? Wo sind die Stärken und Schwächen? Der Vortrag stellt einige von diesen vor und zeigt die Stärken und Schwächen.",
                    "description": "Der Vortrag versucht, einen Überblick über die öffentlich verfügbaren Zensurumgehungswerkzeuge zu geben und diese zu bewerten. Zu Anfang werden kurz mögliche, eher nichttechnische Wege angesprochen. Dann folgt eine Betrachtung von Haystack und Ultrasurf. Insbesondere gehe ich auf die spezifischen Fehler dieser Projekte ein. Einen ähnlichen Ansatz wie die beiden anderen Projekte verfolgt Psiphon. Die verschiedenen Versionen der Software werden kurz vorgestellt.

Später werde ich auf das Konzept der Tor Bridges eingehen. Dies ist wichtig, denn für diverse weitere Dienste ist dies die Grundlage. Insbesondere Proximax und die Flashproxies haben einen Bezug zu den Bridges. Telex.cc stellt den Abschluss der Erklärungen dar.

Der Vortrag stellt die Funktionsweise der diversen Dienste vor und erklärt, wo Stärken und Schwächen liegen. Ich würde mir erhoffen, dass der Vortrag für weitere neue Ansätze oder Verbesserungen der bestehenden Software dient.",
                    "persons": [
                        {"id": "2402",  "full_public_name": "qbi"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5191",
                    "start": "14:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_14:23_-_new_security_concepts_in_gnome_-_tobias_mueller_-_5191",
                    "title": "New Security Concepts in GNOME",
                    "subtitle": "More secure with less “security”",
                    "track": "Open Source Entwicklung",
                    "type": "lecture",
                    "language": "en",
                    "abstract": "The one big problem security faces is users. We interrupt users and and ask them to make informed decisions while they are trying to get things done. We must not prompt. Never. This talk shows some potential approaches and present infrastructure to make that happen.",
                    "description": "Application developers often regret having to deal with security stuff such as certificates or encryption.

This talk will show simple approaches to potentially take in GNOME to relieve app authors of so much security related complexity, while at the same time meeting user expectations of privacy.

Topics include:

    How to store account passwords in your configuration/settings  securely, even when your app is used in a (future) sandbox.
    The simple but correct way to use SSL/TLS to connect securely to online services.
    How to (not) deal with prompting the user about invalid certificates and so on.
    Using single sign on to remove prompting for passwords.

We’ll also highlight some of the infrastructure work that’s been done simplify security, such as the common storage for certificates, secret storage, authentication and so on.


",
                    "persons": [
                        {"id": "3980",  "full_public_name": "Tobias Mueller"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5146",
                    "start": "15:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_15:23_-_train_realtime_data_protocol_-_ollo_-_5146",
                    "title": "Train Realtime Data Protocol",
                    "subtitle": "Netzwerkprotokoll zur Zug-internen Kommunikation",
                    "track": "Sicherheit von Infrastruktur",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "2422",  "full_public_name": "Ollo"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5198",
                    "start": "16:23",
                    "duration": "00:50",
                    "room": "Gate 104",
                    "slug": "gate_104_-_2013-09-08_16:23_-_mrmcd2013_brace_for_impact_-_unicorn_-_5198",
                    "title": "MRMCD2013: Brace for Impact",
                    "subtitle": "",
                    "track": "Luftfahrt",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "The world famous closing ceremony",
                    "persons": [
                        {"id": "1343",  "full_public_name": "Unicorn"}
                    ],
                    "links": [
                    ]
                  }
              ],
              "Gate 111": [
                  {
                    "id": "5149",
                    "start": "11:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-08_11:23_-_gemeinnutzigkeit_im_chaosumfeld_-_punktchen_-_5149",
                    "title": "Gemeinnützigkeit im Chaosumfeld",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "",
                    "description": "",
                    "persons": [
                        {"id": "2491",  "full_public_name": "pünktchen"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5200",
                    "start": "12:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-08_12:23_-_run_your_own_f_cking_infrastructure_-_mc_fly_-_5200",
                    "title": "run your own f*cking infrastructure",
                    "subtitle": "",
                    "track": "Hack the planet",
                    "type": "lecture",
                    "language": "en",
                    "abstract": "a rant that hackers nowerdays stopped running their own infrastructure.

It starts with email who has moved to gmail, with the websites that have moved to blogs, twitter and facebook.

This is a sad development and I think we should change that back.",
                    "description": "I will rant about those late developments of hackers not running their own stuff any and give a summary of reasons why we need to run our own infrastructure. I will give examples where in the short history of the clouds services have been compromised, shut down or taken over.

still a stub but i would like to meet submission deadline.",
                    "persons": [
                        {"id": "3858",  "full_public_name": "mc.fly"}
                    ],
                    "links": [
                    ]
                  },
                  {
                    "id": "5154",
                    "start": "13:23",
                    "duration": "00:50",
                    "room": "Gate 111",
                    "slug": "gate_111_-_2013-09-08_13:23_-_calc_pw_-_kenneth_newwood_-_5154",
                    "title": "calc.pw",
                    "subtitle": "Passwortgenerierung mit Arduino",
                    "track": "Open Source Entwicklung",
                    "type": "lecture",
                    "language": "de",
                    "abstract": "Bei dem Vortrag geht es um mein neustes Projekt &quot;calc.pw&quot;, einer Open-Source Hardware zur Generierung von Passworten. Hierzu wird ein Masterpasswort und eine dienstabhängige Information verwendet, die anhand kryptographischer Methoden (Arc4 und SHA-1) zu einem Dienstpasswort überführt werden.

Das ganze ist mit Arduino-Hardware aufgebaut worden und kann mit Hilfe der zur Verfügung gestellten Aufbauinformationen und des Quelltextes, der unter GPLv3 steht, nachgebaut werden.

Im Vortag soll die Idee hinter calc.pw erklärt werden, es soll der Grund für die Veröffentlichung als Open-Source beleuchtet werden und es sollen die Besonderheiten der Einzelteile erklärt werden (Stichwort Key-Schedule des RC4, Stichwort Speichermanagent des ATMEL, etc.).

Weitere Informationen zum Projekt finden sich hier: http://calc.pw/de",
                    "description": "",
                    "persons": [
                        {"id": "3862",  "full_public_name": "Kenneth Newwood"}
                    ],
                    "links": [
                    ]
                  }
              ],
              "Gate 105 (Workshop Airlines)": [
                  {
                    "id": "5204",
                    "start": "11:23",
                    "duration": "01:50",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-08_11:23_-_lets_blink_-_muzy_-_5204",
                    "title": "Lets blink",
                    "subtitle": "SMD-Lötlern Workshop mit dem RZLblink",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "",
                    "description": "SMD löten - oft als schwierig abgetan aber eigentlich kinderleicht. In diesem Workshop lernst Du anhand des RZLblink, dass auch Du SMD löten kannst. 

Der Workshop dauert in etwa zwei Stunden, Material wird bereitgestellt. Wenn du deinen eigenen Lötkolben nutzen möchtest bringe diesen ruhig mit. Für den Workshop fällt ein Unkostenbeitrag von 13€ pro Workshopteilnehmer an. Bitte finde dich fünf Minuten vor dem Workshop im Workshop-Raum ein, damit wir pünktlich starten können.

Benötigst du keinen Workshop und möchtest für dich alleine ein RZLblink löten, kannst du einen Bausatz für den regulären Preis von 8€ erwerben. 


Note for English speakers: Even though this workshop is delivered in German we can arrange a workshop in English. Please drop me a line at  muzy [here comes the at sign] hacklace [here comes the dot] and the ORG and we will figure out a solution.",
                    "persons": [
                        {"id": "3878",  "full_public_name": "muzy"}
                    ],
                    "links": [
                        {"url": "https://wiki.raumzeitlabor.de/wiki/RZLblink", "title": "RZLblink im RaumZeitLabor Wiki"}
                    ]
                  },
                  {
                    "id": "5205",
                    "start": "13:23",
                    "duration": "02:00",
                    "room": "Gate 105 (Workshop Airlines)",
                    "slug": "gate_105_workshop_airlines_-_2013-09-08_13:23_-_hacklace_lotworkshop_-_muzy_-_5205",
                    "title": "Hacklace Lötworkshop",
                    "subtitle": "Wir löten ein blinkendes Schmuckstück",
                    "track": "",
                    "type": "workshop",
                    "language": "de",
                    "abstract": "Mit dem Hacklace bastelst du dir dein eigenes blinkendes Schmuckstück und lernst dabei spielend einfach Löten. Fertig zusammengebaut kannst du es wie eine Halskette tragen und auf 35 Pixeln kreativ werden - mit deinen eigenen Texten und Animationen",
                    "description": "Noch nie gelötet? Kein Problem. Mit dem Hacklace lernst du spielend einfach löten und hast am Ende ein tolles elektronisches Schmuckstück.

Egal ob auf Parties und in Clubs - mit dem Hacklace setzt du ein leuchtendes Zeichen und bist ein Blickfang. Alternativ auch ein tolles unkonventionelles Geschenk mit deiner Individuellen Botschaft,

Die individuelle Botschaft bekommst du ganz einfach auf dein Hacklace. Mit einem USB-&gt;TTL Adapter an deinen PC anschließen und den Animator auf http://hacklace,org herunterladen und ausführen. Mit nur wenigen Klicks hast du neue Animationen und Texte auf deinem Hacklace! :)

Es fällt bei dem Workshop ein Unkostenbeitrag für 13€ (nur Hacklace) bzw 18€ (Hacklace und USB-&gt;TTL Adapter) an. Bitte bringe diesen Unkostenbeitrag passend zum Workshop mit. Lötutensilien bringen wir mit, wenn du aber mit deinem eigenem Werkzeug löten willst kannst du das natürlich gerne machen!

Benötigst du keinen Workshop und möchtest für dich alleine ein Hacklace löten, kannst du einen Bausatz für den regulären Preis von 10€ erwerben (USB-&gt;TTL Adapter für 5€). 

Note for English speakers: Even though this workshop is delivered in German we can arrange a workshop in English. Please drop me a line at  muzy [here comes the at sign] hacklace [here comes the dot] and the ORG and we will figure out a solution.",
                    "persons": [
                        {"id": "3878",  "full_public_name": "muzy"}
                    ],
                    "links": [
                        {"url": "http://hacklace.org", "title": "Hacklace Website"}
                    ]
                  }
              ]
            }
          }
      ]
    }
  }
}
